SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM21/Include/mgm21_agc.h
/* Bit fields for AGC PNRFATT1 */
#define _AGC_PNRFATT1_RESETVALUE                    0x1848F2C8UL                                /**< Default value for AGC_PNRFATT1              */
#define _AGC_PNRFATT1_MASK                          0x3FFFFFFFUL                                /**< Mask for AGC_PNRFATT1                       */
#define _AGC_PNRFATT1_LNAMIXRFATT6_SHIFT            0                                           /**< Shift value for AGC_LNAMIXRFATT6            */
#define _AGC_PNRFATT1_LNAMIXRFATT6_MASK             0x3FUL                                      /**< Bit mask for AGC_LNAMIXRFATT6               */
#define _AGC_PNRFATT1_LNAMIXRFATT6_DEFAULT          0x00000008UL                                /**< Mode DEFAULT for AGC_PNRFATT1               */
#define AGC_PNRFATT1_LNAMIXRFATT6_DEFAULT           (_AGC_PNRFATT1_LNAMIXRFATT6_DEFAULT << 0)   /**< Shifted mode DEFAULT for AGC_PNRFATT1       */
#define _AGC_PNRFATT1_LNAMIXRFATT7_SHIFT            6                                           /**< Shift value for AGC_LNAMIXRFATT7            */
#define _AGC_PNRFATT1_LNAMIXRFATT7_MASK             0xFC0UL                                     /**< Bit mask for AGC_LNAMIXRFATT7               */
#define _AGC_PNRFATT1_LNAMIXRFATT7_DEFAULT          0x0000000BUL                                /**< Mode DEFAULT for AGC_PNRFATT1               */
#define AGC_PNRFATT1_LNAMIXRFATT7_DEFAULT           (_AGC_PNRFATT1_LNAMIXRFATT7_DEFAULT << 6)   /**< Shifted mode DEFAULT for AGC_PNRFATT1       */
#define _AGC_PNRFATT1_LNAMIXRFATT8_SHIFT            12                                          /**< Shift value for AGC_LNAMIXRFATT8            */
#define _AGC_PNRFATT1_LNAMIXRFATT8_MASK             0x3F000UL                                   /**< Bit mask for AGC_LNAMIXRFATT8               */
#define _AGC_PNRFATT1_LNAMIXRFATT8_DEFAULT          0x0000000FUL                                /**< Mode DEFAULT for AGC_PNRFATT1               */
#define AGC_PNRFATT1_LNAMIXRFATT8_DEFAULT           (_AGC_PNRFATT1_LNAMIXRFATT8_DEFAULT << 12)  /**< Shifted mode DEFAULT for AGC_PNRFATT1       */
#define _AGC_PNRFATT1_LNAMIXRFATT9_SHIFT            18                                          /**< Shift value for AGC_LNAMIXRFATT9            */
#define _AGC_PNRFATT1_LNAMIXRFATT9_MASK             0xFC0000UL                                  /**< Bit mask for AGC_LNAMIXRFATT9               */
#define _AGC_PNRFATT1_LNAMIXRFATT9_DEFAULT          0x00000012UL                                /**< Mode DEFAULT for AGC_PNRFATT1               */
#define AGC_PNRFATT1_LNAMIXRFATT9_DEFAULT           (_AGC_PNRFATT1_LNAMIXRFATT9_DEFAULT << 18)  /**< Shifted mode DEFAULT for AGC_PNRFATT1       */
#define _AGC_PNRFATT1_LNAMIXRFATT10_SHIFT           24                                          /**< Shift value for AGC_LNAMIXRFATT10           */
#define _AGC_PNRFATT1_LNAMIXRFATT10_MASK            0x3F000000UL                                /**< Bit mask for AGC_LNAMIXRFATT10              */
#define _AGC_PNRFATT1_LNAMIXRFATT10_DEFAULT         0x00000018UL                                /**< Mode DEFAULT for AGC_PNRFATT1               */
#define AGC_PNRFATT1_LNAMIXRFATT10_DEFAULT          (_AGC_PNRFATT1_LNAMIXRFATT10_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_PNRFATT1       */

/* Bit fields for AGC PNRFATT2 */
#define _AGC_PNRFATT2_RESETVALUE                    0x00F6E81FUL                                /**< Default value for AGC_PNRFATT2              */
#define _AGC_PNRFATT2_MASK                          0x00FFFFFFUL                                /**< Mask for AGC_PNRFATT2                       */
#define _AGC_PNRFATT2_LNAMIXRFATT11_SHIFT           0                                           /**< Shift value for AGC_LNAMIXRFATT11           */
#define _AGC_PNRFATT2_LNAMIXRFATT11_MASK            0x3FUL                                      /**< Bit mask for AGC_LNAMIXRFATT11              */
#define _AGC_PNRFATT2_LNAMIXRFATT11_DEFAULT         0x0000001FUL                                /**< Mode DEFAULT for AGC_PNRFATT2               */
#define AGC_PNRFATT2_LNAMIXRFATT11_DEFAULT          (_AGC_PNRFATT2_LNAMIXRFATT11_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFATT2       */
#define _AGC_PNRFATT2_LNAMIXRFATT12_SHIFT           6                                           /**< Shift value for AGC_LNAMIXRFATT12           */
#define _AGC_PNRFATT2_LNAMIXRFATT12_MASK            0xFC0UL                                     /**< Bit mask for AGC_LNAMIXRFATT12              */
#define _AGC_PNRFATT2_LNAMIXRFATT12_DEFAULT         0x00000020UL                                /**< Mode DEFAULT for AGC_PNRFATT2               */
#define AGC_PNRFATT2_LNAMIXRFATT12_DEFAULT          (_AGC_PNRFATT2_LNAMIXRFATT12_DEFAULT << 6)  /**< Shifted mode DEFAULT for AGC_PNRFATT2       */
#define _AGC_PNRFATT2_LNAMIXRFATT13_SHIFT           12                                          /**< Shift value for AGC_LNAMIXRFATT13           */
#define _AGC_PNRFATT2_LNAMIXRFATT13_MASK            0x3F000UL                                   /**< Bit mask for AGC_LNAMIXRFATT13              */
#define _AGC_PNRFATT2_LNAMIXRFATT13_DEFAULT         0x0000002EUL                                /**< Mode DEFAULT for AGC_PNRFATT2               */
#define AGC_PNRFATT2_LNAMIXRFATT13_DEFAULT          (_AGC_PNRFATT2_LNAMIXRFATT13_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_PNRFATT2       */
#define _AGC_PNRFATT2_LNAMIXRFATT14_SHIFT           18                                          /**< Shift value for AGC_LNAMIXRFATT14           */
#define _AGC_PNRFATT2_LNAMIXRFATT14_MASK            0xFC0000UL                                  /**< Bit mask for AGC_LNAMIXRFATT14              */
#define _AGC_PNRFATT2_LNAMIXRFATT14_DEFAULT         0x0000003DUL                                /**< Mode DEFAULT for AGC_PNRFATT2               */
#define AGC_PNRFATT2_LNAMIXRFATT14_DEFAULT          (_AGC_PNRFATT2_LNAMIXRFATT14_DEFAULT << 18) /**< Shifted mode DEFAULT for AGC_PNRFATT2       */

/* Bit fields for AGC LNAMIXCODE0 */
#define _AGC_LNAMIXCODE0_RESETVALUE                 0x15724BBDUL                                  /**< Default value for AGC_LNAMIXCODE0           */
#define _AGC_LNAMIXCODE0_MASK                       0x3FFFFFFFUL                                  /**< Mask for AGC_LNAMIXCODE0                    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE1_SHIFT         0                                             /**< Shift value for AGC_LNAMIXSLICE1            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE1_MASK          0x3FUL                                        /**< Bit mask for AGC_LNAMIXSLICE1               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE1_DEFAULT       0x0000003DUL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE1_DEFAULT        (_AGC_LNAMIXCODE0_LNAMIXSLICE1_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE2_SHIFT         6                                             /**< Shift value for AGC_LNAMIXSLICE2            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE2_MASK          0xFC0UL                                       /**< Bit mask for AGC_LNAMIXSLICE2               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE2_DEFAULT       0x0000002EUL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE2_DEFAULT        (_AGC_LNAMIXCODE0_LNAMIXSLICE2_DEFAULT << 6)  /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE3_SHIFT         12                                            /**< Shift value for AGC_LNAMIXSLICE3            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE3_MASK          0x3F000UL                                     /**< Bit mask for AGC_LNAMIXSLICE3               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE3_DEFAULT       0x00000024UL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE3_DEFAULT        (_AGC_LNAMIXCODE0_LNAMIXSLICE3_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE4_SHIFT         18                                            /**< Shift value for AGC_LNAMIXSLICE4            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE4_MASK          0xFC0000UL                                    /**< Bit mask for AGC_LNAMIXSLICE4               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE4_DEFAULT       0x0000001CUL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE4_DEFAULT        (_AGC_LNAMIXCODE0_LNAMIXSLICE4_DEFAULT << 18) /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE5_SHIFT         24                                            /**< Shift value for AGC_LNAMIXSLICE5            */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE5_MASK          0x3F000000UL                                  /**< Bit mask for AGC_LNAMIXSLICE5               */
#define _AGC_LNAMIXCODE0_LNAMIXSLICE5_DEFAULT       0x00000015UL                                  /**< Mode DEFAULT for AGC_LNAMIXCODE0            */
#define AGC_LNAMIXCODE0_LNAMIXSLICE5_DEFAULT        (_AGC_LNAMIXCODE0_LNAMIXSLICE5_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_LNAMIXCODE0    */

